Twisted-Fields/rp2040-motor-firmware/src/hw_setup.h

#define M0_INUH_PIN         8      // active high
#define M0_INUL_PIN         9      // active low
#define M0_INVH_PIN         6      // active high
#define M0_INVL_PIN         7      // active low
#define M0_INWH_PIN         4      // active high
#define M0_INWL_PIN         5      // active low

#define M1_INUH_PIN         14     // active high
#define M1_INUL_PIN         15     // active low
#define M1_INVH_PIN         12     // active high
#define M1_INVL_PIN         13     // active low
#define M1_INWH_PIN         10     // active high
#define M1_INWL_PIN         11     // active low

#define M0_AOUTU_PIN        28 // A3
#define M0_AOUTW_PIN        29 // A4
#define M1_AOUTU_PIN        26 // A1
#define M1_AOUTW_PIN        27 // A2

#define ENCODER0_A_PIN       20
#define ENCODER0_B_PIN       21
#define ENCODER0_Z_PIN       22

#define SENSOR0_RX_PIN       16
#define SENSOR0_CS_PIN       17
#define SENSOR0_SCK_PIN      18

#define ENCODER1_A_PIN       16
#define ENCODER1_B_PIN       17
// #define ENCODER1_Z_PIN       23 // old board
#define ENCODER1_Z_PIN       18

#define ADC_CLK_PIN          22
#define ADC_DATA_PIN         24
#define ADC_CS1_VMOT_PIN     25
#define ADC_CS2_TH0_PIN      2
#define ADC_CS3_TH1_PIN      3
#define ADC_CS4_TH2_PIN      19

#define LED_WS2812_PIN       19
#define LED_WS2812_NUM       3

#define SER_TX_PIN           0
#define SER_RX_PIN           1


